Revit 2027 API
AnalysisDisplayStyleMarkerTextLabelType Enumeration
 Text label visualization types for Markers and Text settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleMarkerTextLabelType
Public Enumeration AnalysisDisplayStyleMarkerTextLabelType
public enum class AnalysisDisplayStyleMarkerTextLabelType
type AnalysisDisplayStyleMarkerTextLabelType
Members
Member name | Value | Description
ShowAll | 0 |  Show text markers for each point
ShowNone | 1 |  Don't show text markers
ShowPredefined | 2 |  Show text markers only for points that have flag ValueAtPointFlags::DisplayText
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace